#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_iam_policy_document.assume_role: Reading...
data.aws_iam_policy_document.assume_role: Read complete after 0s [id=2690255455]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_api_gateway_deployment.deployment will be created
  + resource "aws_api_gateway_deployment" "deployment" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (known after apply)
    }

  # aws_api_gateway_integration.lambda_integration will be created
  + resource "aws_api_gateway_integration" "lambda_integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "ANY"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # aws_api_gateway_method.lambda_method will be created
  + resource "aws_api_gateway_method" "lambda_method" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "ANY"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # aws_api_gateway_rest_api.lambda_api will be created
  + resource "aws_api_gateway_rest_api" "lambda_api" {
      + api_key_source               = (known after apply)
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + body                         = jsonencode(
            {
              + components = {
                  + schemas = {
                      + Empty = {
                          + title = "Empty Schema"
                          + type  = "object"
                        }
                    }
                }
              + info       = {
                  + title   = "lab-apirest"
                  + version = "2024-11-22T23:50:32Z"
                }
              + openapi    = "3.0.1"
              + paths      = {
                  + "/convert"     = {
                      + post = {
                          + responses                       = {
                              + "200" = {
                                  + content     = {
                                      + "application/json" = {
                                          + schema = {
                                              + "$ref" = "#/components/schemas/Empty"
                                            }
                                        }
                                    }
                                  + description = "200 response"
                                }
                            }
                          + x-amazon-apigateway-integration = {
                              + contentHandling     = "CONVERT_TO_TEXT"
                              + httpMethod          = "POST"
                              + passthroughBehavior = "when_no_match"
                              + responses           = {
                                  + default = {
                                      + statusCode = "200"
                                    }
                                }
                              + timeoutInMillis     = 29000
                              + type                = "aws_proxy"
                              + uri                 = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:390402578588:function:lab-lambda/invocations"
                            }
                        }
                    }
                  + "/healthcheck" = {
                      + get = {
                          + responses                       = {
                              + "200" = {
                                  + content     = {
                                      + "application/json" = {
                                          + schema = {
                                              + "$ref" = "#/components/schemas/Empty"
                                            }
                                        }
                                    }
                                  + description = "200 response"
                                }
                            }
                          + x-amazon-apigateway-integration = {
                              + contentHandling     = "CONVERT_TO_TEXT"
                              + httpMethod          = "POST"
                              + passthroughBehavior = "when_no_match"
                              + responses           = {
                                  + default = {
                                      + statusCode = "200"
                                    }
                                }
                              + timeoutInMillis     = 29000
                              + type                = "aws_proxy"
                              + uri                 = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:390402578588:function:lab-lambda/invocations"
                            }
                        }
                    }
                }
              + servers    = [
                  + {
                      + url       = "https://w39hlud5zk.execute-api.us-east-1.amazonaws.com/{basePath}"
                      + variables = {
                          + basePath = {
                              + default = "prod"
                            }
                        }
                    },
                ]
            }
        )
      + created_date                 = (known after apply)
      + description                  = (known after apply)
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = (known after apply)
      + name                         = "lambda_api"
      + policy                       = (known after apply)
      + root_resource_id             = (known after apply)
      + tags_all                     = (known after apply)

      + endpoint_configuration {
          + types            = (known after apply)
          + vpc_endpoint_ids = (known after apply)
        }
    }

  # aws_iam_role.iam_for_lambda will be created
  + resource "aws_iam_role" "iam_for_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "iam_for_lambda"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_lambda_function.lab-lambda will be created
  + resource "aws_lambda_function" "lab-lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "test.zip"
      + function_name                  = "lab-lambda"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs18.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + ephemeral_storage {
          + size = (known after apply)
        }

      + logging_config {
          + application_log_level = (known after apply)
          + log_format            = (known after apply)
          + log_group             = (known after apply)
          + system_log_level      = (known after apply)
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # aws_lambda_permission.api_gw_invoke_permission will be created
  + resource "aws_lambda_permission" "api_gw_invoke_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "lab-lambda"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIGatewayInvoke"
      + statement_id_prefix = (known after apply)
    }

Plan: 7 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @Rauulhub, Action: `pull_request`*